app/views/users/_attendance_record.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
                <th><%= l(at.finished_at.floor_to(15.minutes), format: :time) if at.finished_at.present? %></th>
                <th><%= User.find(at.instructor_confirmation_k).name if at.instructor_confirmation_k.present? %></th>