app/views/users/_edit_overtime_application_information.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        <% @attendances.each do |id, attendances| %>
        <% user = User.find(id) %>