app/views/users/_edit_one_month_information.html.erb

          <% @attendances.each do |id, attendances| %>
          <center>【<%= User.find(id).name  %>からの勤怠変更申請】</center>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]