app/views/users/_edit_one_month_application_information.html.erb

        <% @attendances.each do |id, attendances| %>
        <center>【<%= User.find(id).name  %>からの一ヶ月分勤怠申請】</center>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]