app/views/users/attendance_confirmation.html.erb

              <% if day.application == "申請中" %>
                <% superior = User.find(day.instructor_confirmation) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]