app/views/users/show.html.erb

              <% if day.application == "申請中" %>
                <% superior = User.find(day.instructor_confirmation) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

            <% elsif @superior_flag.application_ok == "申請中" %>
              <% superior = User.find(@superior_flag.instructor_confirmation_ok) %>
---
SELECT "users".* FROM "users" WHERE "users"."superior_flag" = ? AND ("users"."id" != 2)  [["superior_flag", "t"]]