app/controllers/attendances_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "attendances" SET "finished_at" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["finished_at", "2021-04-05 10:43:00"], ["updated_at", "2021-04-05 10:43:35.936996"], ["id", 5]]
---
  def update
    @user = User.find(params[:user_id])
    @attendance = Attendance.find(params[:id])
    # 出勤時間が未登録であることを判定します。
    if @attendance.started_at.nil? # もし、出社時間がない場合
      # 出社時間が現在の時間の時、勤怠データを更新。
      if @attendance.update_attributes(started_at: Time.current.change(sec: 0))

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."superior_flag" = ? AND ("users"."id" != 2)  [["superior_flag", "t"]]
---
  def edit_one_month
    @user = User.find(params[:id])
    # 上長フラグがtrueのユーザーを取得
    @superior = User.where(superior_flag: true).where.not(id: @user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
  def update_one_month
    @user = User.find(params[:id])

    ActiveRecord::Base.transaction do # トランザクションを開始。
      # データベースの操作を保障したい処理を以下に記述。
      # Attendanceモデルオブジェクトのidと、各カラムの値が入った更新するための情報であるitemを指す。
      n = 0
      attendances_params.each do |id, item|
        attendance = Attendance.find(id)

UPDATE "attendances" SET "edit_started_at" = ?, "instructor_confirmation_k" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["edit_started_at", "2021-04-01 00:00:00"], ["instructor_confirmation_k", nil], ["updated_at", "2021-04-29 12:39:36.577909"], ["id", 31]]
---

          item[:application_k] = "申請中"
          # !をつけている場合はfalseでは無く例外処理を返す。
          attendance.update_attributes!(item) # ここにトランザクションを適用。

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."superior_flag" = ? AND ("users"."id" != 4)  [["superior_flag", "t"]]
---
  def edit_overtime_info
    @user = User.find(params[:user_id])
    @attendance = Attendance.find(params[:id])
    @superior = User.where(superior_flag: true).where.not(id: @user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "attendances" SET "scheduled_end_time" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["scheduled_end_time", "2021-04-25 13:00:00"], ["updated_at", "2021-04-25 10:35:30.699620"], ["id", 1]]
---
  def update_overtime_info
    @user = User.find(params[:user_id])
    @attendance = Attendance.find(params[:id])

    if params[:attendance][:scheduled_end_time].blank? && params[:attendance][:business_processing_content].blank?
      flash[:danger] = "終了予定時間及び業務処理内容が空です。"
      redirect_to user_url(@user) and return
    end

    if params[:attendance][:scheduled_end_time].blank? # params[:a][:b] => a：　この場合「attendance」の中の b: 「scheduled_end_time」と言うふうに書く。
      flash[:danger] = "終了予定時間が空です。"
      redirect_to user_url(@user) and return # and return = 一つのアクションにつき「redirect_to」が2つ以上存在した場合、添付する。
    end

    if params[:attendance][:business_processing_content].blank?
      flash[:danger] = "業務処理内容が空です。"
      redirect_to user_url(@user) and return # and return = 一つのアクションにつき「redirect_to」が2つ以上存在した場合、添付する。
    end

    if params[:attendance][:instructor_confirmation].blank?
      flash[:danger] = "指示者確認が空です。"
      redirect_to user_url(@user) and return
    end

    if @attendance.instructor_confirmation.present?
       @attendance.application = "申請中"
    end

    if @attendance.update_attributes(overtime_params)