app/controllers/bases_controller.rb

  def index
    @base = Base.new
    @bases = Base.all
---
SELECT "bases".* FROM "bases"

  def create

    if params[:base][:base_number].blank? && params[:base][:base_name].blank? && params[:base][:attendance_type].blank?
      flash[:danger] = "3項目が空です。"
      redirect_to bases_path and return
    end
    #saveメソッドでデータをセーブ　*newメソッド + saveメソッド = createメソッド

    if params[:base][:base_number].blank?
      flash[:danger] = "拠点番号が空です。"
      redirect_to bases_path and return
    end

    if params[:base][:base_name].blank?
      flash[:danger] = "拠点名が空です。"
      redirect_to bases_path and return
    end

    if params[:base][:attendance_type].blank?
      flash[:danger] = "勤怠種類が空です。"
      redirect_to bases_path and return
    end
    if params[:base][:base_number].present? && params[:base][:base_name].present? && params[:base][:attendance_type].present?
       #formのデータを受け取る
      @base =Base.create(edit_bases_params)
---
INSERT INTO "bases" ("base_name", "attendance_type", "base_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["base_name", "東京"], ["attendance_type", "出勤"], ["base_number", 1], ["created_at", "2021-04-03 05:37:47.733303"], ["updated_at", "2021-04-03 05:37:47.733303"]]