app/controllers/list_of_employees_at_work_controller.rb

SELECT "users".* FROM "users"
SELECT "attendances".* FROM "attendances" WHERE "attendances"."user_id" = ?  [["user_id", 1]]
---
  def index
    # any => どれか1つでも条件を満たすのであればtrue、すべて条件を満たさないのであればfalseを返すメソッド
    # 更新する勤怠データを取得
    # 「出社」をクリックすると、「@now_users」の配列にユーザー名が格納される。
    @working_users = []
      # Userテーブルの全てのデータをeach
      User.all.each do |user|
      # userモデルとattendanceモデルを紐付けて
      # any => どれか1つでも条件を満たすのであればtrue、すべて条件を満たさないのであればfalseを返すメソッド
      if user.attendances.any?{|a|( a.started_at.present? && a.finished_at.blank? )}