app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sample-01@email.com"], ["LIMIT", 1]]
---
  def create
    # .downcase　⇨　入力したメールアドレスは全て小文字として判定
    user = User.find_by(email: params[:session][:email].downcase)